# GS_EdSh_ConstructLayout

## Description
Creates a dialog layout for editing a shader's parameter values.

```pascal
PROCEDURE GS_EdSh_ConstructLayout(
				shaderNameCStr : ANY;
				paramsPtr      : ANY;
				libraryDataPtr : ANY);
```

```python

def vs.GS_EdSh_ConstructLayout(shaderNameCStr, paramsPtr, libraryDataPtr):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|shaderNameCStr|ANY||
|paramsPtr|ANY||
|libraryDataPtr|ANY||

## Version
Availability: from Vectorworks 2014
## Category
* Textures